[
  {
    "title": "Anime Tracker",
    "summary": "A full-stack application to help users track their anime watching habits, manage subscriptions, and receive notifications for new episode releases.",
    "tags": [
      "TypeScript",
      "React",
      "React router",
      "ExpressJS (fastify)",
      "MongoDB",
      "Vitest",
      "Playwright",
      "JikanAPI"
    ],
    "challenge": "The Jikan API has strict rate limits that could impact user experience during peak usage or frequent searches",
    "solution": "Implemented a caching strategy using MongoDB to store frequently accessed anime data, reducing external API calls by ~80%. Added request throttling and queue management to stay within rate limits while maintaining responsiveness following the 80/20 rule",
    "impact": "Learned to work with external APIs including rate limiting, caching strategies, and error handling",
    "source_url": "https://github.com/mauricefh/anime_tracker",
    "demo_url": "",
    "medias": [],
    "status": "In Development"
  },
  {
    "title": "Job Application Tracker",
    "summary": "A productivity tool designed to help job seekers manage their application pipeline, track follow-ups, and maintain organized records of their job search process",
    "tags": [
      "TypeScript",
      "Tanstack Start",
      "PostgreSQL",
      "Prisma ORM",
      "Supabase"
    ],
    "challenge": "Job seekers often forget to follow up at appropriate intervals, potentially missing opportunities to demonstrate interest and professionalism.",
    "solution": "Implemented an intelligent timing system that automatically surfaces follow-up actions 3 days after the application date. Combined with email reminders and one-click template sending to reduce friction and ensure consistent follow-through.",
    "impact": "Practiced building intuitive UX patterns like context menus and automated workflows",
    "source_url": "https://github.com/mauricefh/job_application_tracker",
    "demo_url": "",
    "medias": [],
    "status": "Design"
  },
  {
    "title": "Helhest Cane Corso",
    "summary": "A web platform connecting prospective dog owners with Cane Corso breeders, facilitating puppy adoption inquiries, and providing educational resources about the breed and responsible ownership.",
    "tags": [
      "TypeScript",
      "NextJS",
      "PostgreSQL",
      "Drizzle ORM",
      "AWS S3"
    ],
    "challenge": "Litters are born periodically, creating gaps where no puppies are available. Turning away interested families during these periods results in lost connections and potential adopters going elsewhere.",
    "solution": "Created an intelligent form system that adapts based on current puppy availability. When no litters are available, prospective adopters can submit applications to join a waitlist for upcoming litters, maintaining engagement and building a pipeline of pre-qualified families.",
    "impact": "Practiced implementing conditional business logic that adapts to real-world constraints and gained hands-on experience with cloud storage architecture (AWS S3)",
    "source_url": "https://github.com/mauricefh/helest_cane_corso",
    "demo_url": "https://helehstcanecorso.com",
    "medias": [
      {
        "type": "image",
        "url": "/helhest_cane_corso/1.png"
      },
      {
        "type": "image",
        "url": "/helhest_cane_corso/2.png"
      },
      {
        "type": "image",
        "url": "/helhest_cane_corso/3.png"
      }
    ],
    "status": "Completed"
  },
  {
    "title": "Portfolio",
    "summary": "A recruiter-optimized portfolio website showcasing development work through video demonstrations and strategic presentation, designed to maximize engagement and communicate technical capabilities within the first critical seconds of a recruiter's visit.",
    "tags": [
      "Astro"
    ],
    "challenge": "Recruiters spend an average of 6-8 seconds on initial portfolio reviews. Traditional text-heavy portfolios fail to communicate value quickly enough, resulting in missed opportunities regardless of actual skill level.",
    "solution": "Designed a video-first approach where each project leads with a visual demonstration. Recruiters can immediately see working software and understand capabilities without reading lengthy descriptions. The 50/50 hero split ensures immediate visual engagement while maintaining essential context.",
    "impact": "Practiced content strategy and information design, learning to balance showing enough depth to prove competence while maintaining scanability for time-constrained viewers",
    "source_url": "https://github.com/mauricefh/portfolio",
    "demo_url": "#",
    "medias": [],
    "status": "Completed"
  }
]